{
  "auto_mapping": null,
  "base_model_name_or_path": "./base_model/LLaMA2-7b-chat-base-model/hf_ckpt",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "q_proj",
    "gate_proj",
    "o_proj",
    "up_proj",
    "down_proj",
    "v_proj",
    "k_proj"
  ],
  "task_type": "CAUSAL_LM"
}